import math

# численные типы данных
# int - целое число
# float - дробное число
#
# имя переменной = значение
# x = 10
# y = 10.1
# summa = (x + y) * 5
# + - * /
# // - целая часть от деления a на b
# % - остаток от деления a на b
# ** - возведение в степень
# print(summa)
# print(17 % 4)
# input()

# str - строковый тип данных
# str()
# 'правпрл' "аываываыв" '''fsdfsdgffgdf'''
name = input('Введите имя: ')
print("Ваше имя:", name)

# напишите программу,
# спрашивающую имя и фамилию в двух отдельных строках
# и выводящую "вас зовут: имя фамилия"

# ввести 2 переменные x и y
# вывести сумму
x = int(input())
y = int(input())
print(x + y)
# int - тип данных
# int() - функция, превращающая то что в скобках в int

# float - тип данных
# float() - функция, превращающая то что в скобках в float
