print() # выводит элементы
input() # ввод с клавиатуры
int() # делает аргумент целочисленным
str() # делает аргумент строковым
len() # возвращает количество элементов в аргументе (списке/строке/итд)
sum() # находит сумму элементов в списке

# методы списков
lst = []
lst.append() # добавляет аргумент в список, от которого вызывается метод

# строковые методы
s = 'hello world'
s.split() # разделяет строку по аргументу, если аргумента нет разделяет по пробелу
s.replace() # replace(что меняешь, на что меняешь, сколько раз), если третьего аргумента нет меняешь все

# общие методы
s.count() # находит количество элементов = аргументу в списке/строке
s.index() # находит индекс аргумента